GQstersProjects/RP2040-Tests/ESP32/esp32_FPV_tank/src/app_server.cpp
    int val = atoi(value);
    sensor_t * s = esp_camera_sensor_get();
    int res = 0;

    heartbeat = millis();
    
    if(!strcmp(variable, "framesize")) 
    {
        Serial.println("framesize");
        if(s->pixformat == PIXFORMAT_JPEG) res = s->set_framesize(s, (framesize_t)val);
    }
    else if(!strcmp(variable, "quality")) 
    {
      Serial.println("quality");
      res = s->set_quality(s, val);
    }
    //Remote Control
    else if(!strcmp(variable, "flash")) 
    {
      ledcWrite(7,val);
    }
    else if(!strcmp(variable, "speed")) 
    {
      if      (val > 8) val = 8;
      else if (val <   0) val = 0;       
      speed = val * endpoint;
    }
    else if(!strcmp(variable, "ltrim")) 
    {
      if      (val > 192) val = 192;
      else if (val < -192) val = -192;
      lneutral = neutral+val; 
      ledcWrite(3,lneutral);
    }
    else if(!strcmp(variable, "rtrim")) 
    {
      if      (val > 192) val = 192;
      else if (val < -192) val = -192;
      rneutral = neutral-val;
      ledcWrite(4,rneutral);
    }
    else if(!strcmp(variable, "car")) {  
      if (val==1) {
        Serial.println("Forward");
        actstate = fwd; // Set state to modify left & right behavior while moving.   
        ledcWrite(3,lneutral+speed);  // GPIO pin 12 - Left Servo adds speed to neutral value
        ledcWrite(4,rneutral-speed);  // GPIO pin 13 - Right Servo subtracts speed from neutral value
      }
      else if (val==2) {
        Serial.println("Backward");  
        actstate = rev; // Set state to modify left & right behavior while moving.      
        ledcWrite(3,lneutral-speed);  // GPIO pin 12 Left Servo
        ledcWrite(4,rneutral+speed);  // GPIO pin 13 Right Servo        
      }
      else if (val==3) {
        Serial.println("TurnLeft");
        if      (actstate == fwd) { ledcWrite(3,lneutral+speed*.33); ledcWrite(4,rneutral-speed); }
        else if (actstate == rev) { ledcWrite(3,lneutral-speed*.33); ledcWrite(4,rneutral+speed); }
        else                      { ledcWrite(3,lneutral-speed*.75); ledcWrite(4,rneutral-speed*.75); }          
      }
      else if (val==4) {
        Serial.println("TurnRight");
        if      (actstate == fwd) { ledcWrite(3,lneutral+speed); ledcWrite(4,rneutral-speed*.33); }
        else if (actstate == rev) { ledcWrite(3,lneutral-speed); ledcWrite(4,rneutral+speed*.33); }
        else                      { ledcWrite(3,lneutral+speed*.75); ledcWrite(4,rneutral+speed*.75); }        
      }
      else {
        Serial.println("Stop");
        actstate = stp;
        ledcWrite(3,lneutral); // Send no pulse to disable servo (no drift).
        ledcWrite(4,rneutral); // Send no pulse to disable servo (no drift).       
      } 
    }        
    else 
    { 
      Serial.println("variable");
      res = -1; 
    }

    if(res){ return httpd_resp_send_500(req); }

    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, NULL, 0);
}

static esp_err_t status_handler(httpd_req_t *req){
    static char json_response[1024]; 

    sensor_t * s = esp_camera_sensor_get();
    char * p = json_response;
    *p++ = '{';

    p+=sprintf(p, "\"framesize\":%u,", s->status.framesize);
    p+=sprintf(p, "\"quality\":%u,", s->status.quality);
    *p++ = '}';
    *p++ = 0;
    httpd_resp_set_type(req, "application/json");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_send(req, json_response, strlen(json_response));
}

// Front End / GUI Webpage
static const char PROGMEM INDEX_HTML[] = R"rawliteral(
<!DOCTYPE html>
<!--
<html>
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>ESP32 Tank!</title>
<style>
body, html {
    height: 100%;
    width: 100%;
    margin: 0;
    padding: 0;
    font-family: Arial;
    background: #006666;
}

/* Style the tab */
.tab {
    overflow: hidden;
    border: 1px solid #ccc;
    background-color: #009999;
}

/* Style the buttons inside the tab */
.tab button {
    background-color: inherit;
    float: left;
    border: none;
    outline: none;
    cursor: pointer;
    padding: 14px 16px;
    transition: 0.3s;
    font-size: 17px;
}

/* Change background color of buttons on hover */
.tab button:hover {
    background-color: #cc66ff;
}

/* Create an active/current tablink class */
.tab button.active {
    background-color: #cc99ff;
}

/* Style the tab content */
.tabcontent {
    display: none;
    padding: 0; /* Adjusted padding to 0 */
    border: 1px solid #ccc;
    border-top: none;
    height: 100%; /* Adjust height as needed */
    -webkit-animation: fadeEffect 1s;
    animation: fadeEffect 1s;
    box-sizing: border-box; /* Include padding within height calculation */
}

/* Fade in tabs */
@-webkit-keyframes fadeEffect {
    from {opacity: 0;}
    to {opacity: 1;}
}

@keyframes fadeEffect {
    from {opacity: 0;}
    to {opacity: 1;}
}


</style>
</head>
<body>

<div class="tab">
  <button class="tablinks" onclick="openCity(event, 'Viewer')" id="defaultOpen">Viewer</button>
  <button class="tablinks" onclick="openCity(event, 'Settings')">Settings</button>
</div>

<div id="Viewer" class="tabcontent">
  <section id="mainViewer">
    <figure>
      <div id="stream-container" class="image-container">
        <img id="stream" src="" style="transform: rotate(270deg);">
      </div>
    </figure>
  </section>
</div>

<div id="Settings" class="tabcontent">
  <section id="mainSettings">
    <figure>
    </figure>
    <section id="buttons">
      <table>
        <tr><td align="center">
        <tr><td align="center">Speed</td><td align="center" colspan="2"><input type="range" id="speed" min="0" max="8" value="8" onchange="try{fetch(document.location.origin+'/control?var=speed&val='+this.value);}catch(e){}"></td></tr>
        <tr><td align="center">Left Trim</td><td align="center" colspan="2"><input type="range" id="ltrim" min="-192" max="192" value="0" onchange="try{fetch(document.location.origin+'/control?var=ltrim&val='+this.value);}catch(e){}"></td></tr>
        <tr><td align="center">Right Trim</td><td align="center" colspan="2"><input type="range" id="rtrim" min="-192" max="192" value="0" onchange="try{fetch(document.location.origin+'/control?var=rtrim&val='+this.value);}catch(e){}"></td></tr>
        <tr><td align="center">Lights</td><td align="center" colspan="2"><input type="range" id="flash" min="0" max="255" value="0" onchange="try{fetch(document.location.origin+'/control?var=flash&val='+this.value);}catch(e){}"></td></tr>
        <tr><td align="center">Quality</td><td align="center" colspan="2"><input type="range" id="quality" min="10" max="63" value="10" onchange="try{fetch(document.location.origin+'/control?var=quality&val='+this.value);}catch(e){}"></td></tr>
        <tr><td align="center">Resolution</td><td align="center" colspan="2"><input type="range" id="framesize" min="0" max="6" value="5" onchange="try{fetch(document.location.origin+'/control?var=framesize&val='+this.value);}catch(e){}"></td></tr>
        <tr><td align="center">Rotation</td><td align="center" colspan="2"><input type="button" value="Rotate Cam" id="rotate" onclick="rotateImg()"></td></tr>
    </table>
    </section>
  </section>
</div>


<script>
  // Function for the tabs
  function openCity(evt, cityName) {
  var i, tabcontent, tablinks;
  tabcontent = document.getElementsByClassName("tabcontent");
  for (i = 0; i < tabcontent.length; i++) {
      tabcontent[i].style.display = "none";
  }
  tablinks = document.getElementsByClassName("tablinks");
  for (i = 0; i < tablinks.length; i++) {
      tablinks[i].className = tablinks[i].className.replace(" active", "");
  }
  document.getElementById(cityName).style.display = "block";
  evt.currentTarget.className += " active";
  }

  // Get the element with id="defaultOpen" and click on it
  document.getElementById("defaultOpen").click();




